#### Terraform Plan Succeeded ✅

Changes are proposed in the plan below:

<details><summary>詳細</summary>```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.allow_iap_ssh will be created
  + resource "google_compute_firewall" "allow_iap_ssh" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-iap-ssh-ingress"
      + network            = "gce-vpc-network"
      + priority           = 1000
      + project            = "trading-daichi-ozaki213"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "35.235.240.0/20",
        ]
      + target_tags        = [
          + "allow-ssh",
        ]

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_instance_group_manager.llm_app_mig will be created
  + resource "google_compute_instance_group_manager" "llm_app_mig" {
      + base_instance_name             = "llm-app-vm"
      + creation_timestamp             = (known after apply)
      + fingerprint                    = (known after apply)
      + id                             = (known after apply)
      + instance_group                 = (known after apply)
      + instance_group_manager_id      = (known after apply)
      + list_managed_instances_results = "PAGELESS"
      + name                           = "llm-app-mig"
      + operation                      = (known after apply)
      + project                        = "trading-daichi-ozaki213"
      + self_link                      = (known after apply)
      + status                         = (known after apply)
      + target_size                    = 1
      + target_stopped_size            = (known after apply)
      + target_suspended_size          = (known after apply)
      + wait_for_instances             = false
      + wait_for_instances_status      = "STABLE"
      + zone                           = "asia-northeast1-a"

      + named_port {
          + name = "http"
          + port = 80
        }

      + version {
          + instance_template = (known after apply)
        }
    }

  # google_compute_instance_template.llm_app_template will be created
  + resource "google_compute_instance_template" "llm_app_template" {
      + can_ip_forward          = false
      + creation_timestamp      = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                      = (known after apply)
      + machine_type            = "g2-standard-4"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<-EOT
            #!/bin/bash
            echo "Setting up server..."
            # apt-get update, install docker, etc.
        EOT
      + name                    = (known after apply)
      + name_prefix             = "llm-app-template-"
      + numeric_id              = (known after apply)
      + project                 = "trading-daichi-ozaki213"
      + region                  = "asia-northeast1"
      + self_link               = (known after apply)
      + self_link_unique        = (known after apply)
      + tags                    = [
          + "allow-ssh",
          + "http-server",
        ]
      + tags_fingerprint        = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }

      + disk {
          + architecture           = (known after apply)
          + auto_delete            = true
          + boot                   = true
          + device_name            = (known after apply)
          + disk_size_gb           = (known after apply)
          + disk_type              = (known after apply)
          + interface              = (known after apply)
          + mode                   = (known after apply)
          + provisioned_iops       = (known after apply)
          + provisioned_throughput = (known after apply)
          + source_image           = "debian-cloud/debian-11"
          + type                   = (known after apply)
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)
        }

      + scheduling {
          + automatic_restart           = true
          + instance_termination_action = "DELETE"
          + on_host_maintenance         = (known after apply)
          + preemptible                 = false
          + provisioning_model          = "SPOT"
        }

      + service_account {
          + email  = "gce-llm-app-sa@trading-daichi-ozaki213.iam.gserviceaccount.com"
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

  # google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "gce-vpc-network"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "trading-daichi-ozaki213"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # google_compute_subnetwork.gce_subnet will be created
  + resource "google_compute_subnetwork" "gce_subnet" {
      + creation_timestamp         = (known after apply)
      + enable_flow_logs           = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.0.1.0/24"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "gce-subnet"
      + network                    = (known after apply)
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "trading-daichi-ozaki213"
      + purpose                    = (known after apply)
      + region                     = "asia-northeast1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)
    }

  # google_project_iam_member.pubsub_publisher will be created
  + resource "google_project_iam_member" "pubsub_publisher" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:gce-llm-app-sa@trading-daichi-ozaki213.iam.gserviceaccount.com"
      + project = "trading-daichi-ozaki213"
      + role    = "roles/pubsub.publisher"
    }

  # google_project_iam_member.pubsub_subscriber will be created
  + resource "google_project_iam_member" "pubsub_subscriber" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:gce-llm-app-sa@trading-daichi-ozaki213.iam.gserviceaccount.com"
      + project = "trading-daichi-ozaki213"
      + role    = "roles/pubsub.subscriber"
    }

  # google_project_iam_member.sql_client will be created
  + resource "google_project_iam_member" "sql_client" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:gce-llm-app-sa@trading-daichi-ozaki213.iam.gserviceaccount.com"
      + project = "trading-daichi-ozaki213"
      + role    = "roles/cloudsql.client"
    }

  # google_project_iam_member.storage_reader will be created
  + resource "google_project_iam_member" "storage_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:gce-llm-app-sa@trading-daichi-ozaki213.iam.gserviceaccount.com"
      + project = "trading-daichi-ozaki213"
      + role    = "roles/storage.objectAdmin"
    }

  # google_pubsub_subscription.doc_update_sub will be created
  + resource "google_pubsub_subscription" "doc_update_sub" {
      + ack_deadline_seconds       = 60
      + effective_labels           = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "document-update-subscription"
      + project                    = "trading-daichi-ozaki213"
      + terraform_labels           = {
          + "goog-terraform-provisioned" = "true"
        }
      + topic                      = "document-update-topic"
    }

  # google_pubsub_topic.doc_update_topic will be created
  + resource "google_pubsub_topic" "doc_update_topic" {
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + id               = (known after apply)
      + name             = "document-update-topic"
      + project          = "trading-daichi-ozaki213"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
    }

  # google_service_account.gce_service_account will be created
  + resource "google_service_account" "gce_service_account" {
      + account_id   = "gce-llm-app-sa"
      + disabled     = false
      + display_name = "Service Account for LLM App GCE Instances"
      + email        = "gce-llm-app-sa@trading-daichi-ozaki213.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:gce-llm-app-sa@trading-daichi-ozaki213.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "trading-daichi-ozaki213"
      + unique_id    = (known after apply)
    }

  # google_sql_database.default will be created
  + resource "google_sql_database" "default" {
      + charset         = (known after apply)
      + collation       = (known after apply)
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "llm-app-db-instance"
      + name            = "vector-db"
      + project         = "trading-daichi-ozaki213"
      + self_link       = (known after apply)
    }

  # google_sql_database_instance.postgres will be created
  + resource "google_sql_database_instance" "postgres" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_15"
      + deletion_protection            = true
      + dns_name                       = (known after apply)
      + dns_names                      = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "llm-app-db-instance"
      + node_count                     = (known after apply)
      + private_ip_address             = (known after apply)
      + project                        = "trading-daichi-ozaki213"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "asia-northeast1"
      + replica_names                  = (known after apply)
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + settings {
          + activation_policy           = "ALWAYS"
          + availability_type           = "ZONAL"
          + connector_enforcement       = (known after apply)
          + disk_autoresize             = true
          + disk_autoresize_limit       = 0
          + disk_size                   = (known after apply)
          + disk_type                   = (known after apply)
          + edition                     = (known after apply)
          + effective_availability_type = (known after apply)
          + pricing_plan                = "PER_USE"
          + tier                        = "db-g1-small"
          + user_labels                 = (known after apply)
          + version                     = (known after apply)

          + ip_configuration {
              + ipv4_enabled    = true
              + private_network = (known after apply)
              + server_ca_mode  = (known after apply)
              + ssl_mode        = (known after apply)
            }
        }
    }

  # google_sql_user.default will be created
  + resource "google_sql_user" "default" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "llm-app-db-instance"
      + name                    = "gce-llm-app-sa@trading-daichi-ozaki213.iam"
      + project                 = "trading-daichi-ozaki213"
      + sql_server_user_details = (known after apply)
      + type                    = "IAM_USER"
    }

  # google_storage_bucket.app_bucket will be created
  + resource "google_storage_bucket" "app_bucket" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "app-data-bucket-trading-daichi-ozaki213"
      + project                     = "trading-daichi-ozaki213"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + db_instance_connection_name = (known after apply)
  + gcs_bucket_name             = "app-data-bucket-trading-daichi-ozaki213"
```</details>